## Create Data Frames

In [4]:
import pandas as pd

### Method 1: Nested List

In [15]:


data = [['Logistic Lemongrass', 15], 
        ['Jupyter Jasmine', 13], 
        ['Allspice Arrays', 15]]

df = pd.DataFrame(data, index=['A', 'B', 'C'], columns = ['name', 'students'])

In [10]:
df

                  name  students
A  Logistic Lemongrass        15
B      Jupyter Jasmine        13
C      Allspice Arrays        15

### Method 2: Dictionary

In [16]:
data = {
    'name': ['Logistic Lemongrass', 'Jupyter Jasmine', 'Allspice Arrays'],
    'students': [15,13,15]
}

df = pd.DataFrame(data, index = ['A','B','C'])
df

                  name  students
A  Logistic Lemongrass        15
B      Jupyter Jasmine        13
C      Allspice Arrays        15

### Method 3: Using Numpy

In [19]:
import numpy as np

In [23]:
a= np.arange(25).reshape(5,5)
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [25]:
pd.DataFrame(a, index=list('abcde'), columns=list('ABCDE'))

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [30]:
b= np.arange(2500).reshape(-1,5) # the -1 means "take as many as you need"
b

array([[   0,    1,    2,    3,    4],
       [   5,    6,    7,    8,    9],
       [  10,   11,   12,   13,   14],
       ...,
       [2485, 2486, 2487, 2488, 2489],
       [2490, 2491, 2492, 2493, 2494],
       [2495, 2496, 2497, 2498, 2499]])

In [31]:
pd.DataFrame(b, columns = list('ABCDE'))

        A     B     C     D     E
0       0     1     2     3     4
1       5     6     7     8     9
2      10    11    12    13    14
3      15    16    17    18    19
4      20    21    22    23    24
..    ...   ...   ...   ...   ...
495  2475  2476  2477  2478  2479
496  2480  2481  2482  2483  2484
497  2485  2486  2487  2488  2489
498  2490  2491  2492  2493  2494
499  2495  2496  2497  2498  2499

[500 rows x 5 columns]

### Method 4: read from a file

In [35]:
pd.read_csv('~/Desktop/Spiced/intro_pandas/large_countries_2015.csv')

       Unnamed: 0    population  fertility      continent
0      Bangladesh  1.609956e+08       2.12           Asia
1          Brazil  2.078475e+08       1.78  South America
2           China  1.376049e+09       1.57           Asia
3           India  1.311051e+09       2.43           Asia
4       Indonesia  2.575638e+08       2.28           Asia
5           Japan  1.265735e+08       1.45           Asia
6          Mexico  1.270172e+08       2.13  North America
7         Nigeria  1.822020e+08       5.89         Africa
8        Pakistan  1.889249e+08       3.04           Asia
9     Philippines  1.006994e+08       2.98           Asia
10         Russia  1.434569e+08       1.61         Europe
11  United States  3.217736e+08       1.97  North America